alex120400/STM32_Tasks/stm_task4_exti_uart/static/exti_uart.c
/* STM32-Task 4: EXTI UART

In this task, your goal is to utilize the EXTended Interrupt controller to controll
transmissions from the UART2 by pushing the switches. 

Put relevant code for setting up the peripherals in their respective functions and
put code to start relevant peripherals at the respective position in the code below

Good Luck!

*/


#include "stm32f3xx_ll_rcc.h"
#include "stm32f3xx_ll_bus.h"
#include "stm32f3xx_ll_system.h"
#include "stm32f3xx_ll_utils.h"
#include "stm32f3xx_ll_gpio.h"
#include "stm32f3xx_ll_exti.h"
#include "stm32f3xx_ll_usart.h"
#include <stdint.h>


void SystemClock_Config(void);
static void GPIO_Init(void);
static void UART2_Init(void);
static void EXTI_Init(void);
// implement the respective interupt service routine using one of the following function headers
//void EXTI15_10_IRQHandler(void);
//void EXTI3_IRQHandler(void);




int main(void)
{

  SystemClock_Config();

  /* Initialize all configured peripherals */
  GPIO_Init();
  UART2_Init();
  EXTI_Init();

  while (1)
  {

  }
}


/** EXTI Initialization Function
 * put here all code relevant to the EXTI configuration including priority settings
*/
static void EXTI_Init(void)
{

}


/** GPIO Initialization Function
 * put here all code relevant to the gpio configuration
*/
static void GPIO_Init(void)
{
  
}


/** USART2 Initialization Function
  * put here all code relevant to the UART2 configuration
*/
static void UART2_Init(void)
{
  
}


/** Interrupt Service Routine
  * implement down below the Interrupt service routine with one of the names exactly as stated at the beginning
*/
//void EXTI15_10_IRQHandler(void){
//
//}
//void EXTI3_IRQHandler(void){
//
//}



/* System Clock Configuration, do not change code here, CPU frequency is 64 MHz */
void SystemClock_Config(void)
{
  LL_FLASH_SetLatency(LL_FLASH_LATENCY_2);
  while(LL_FLASH_GetLatency()!= LL_FLASH_LATENCY_2)
  {
  }
  LL_RCC_HSI_Enable();

   /* Wait till HSI is ready */
  while(LL_RCC_HSI_IsReady() != 1)
  {

  }
  LL_RCC_HSI_SetCalibTrimming(16);
  LL_RCC_PLL_ConfigDomain_SYS(LL_RCC_PLLSOURCE_HSI_DIV_2, LL_RCC_PLL_MUL_16);
  LL_RCC_PLL_Enable();

   /* Wait till PLL is ready */
  while(LL_RCC_PLL_IsReady() != 1)
  {

  }
  LL_RCC_SetAHBPrescaler(LL_RCC_SYSCLK_DIV_1);
  LL_RCC_SetAPB1Prescaler(LL_RCC_APB1_DIV_2);
  LL_RCC_SetAPB2Prescaler(LL_RCC_APB2_DIV_1);
  LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_PLL);

   /* Wait till System clock is ready */
  while(LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_PLL)
  {

  }
  LL_Init1msTick(64000000);
  LL_SetSystemCoreClock(64000000);
}





